# PresetInitialColor Constructor (ColorPreset) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PresetInitialColor Constructor (ColorPreset)
PresetInitialColor Class See Also
---
Creates an initial color preset object with the given preset value.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PresetInitialColor(
	ColorPreset presetIn
)
```

Visual Basic
---
```text
Public Sub New ( _
	presetIn As ColorPreset _
)
```

Visual C++
---
```text
public:
PresetInitialColor(
	ColorPreset presetIn
)
```

# ### Parameters
presetIn
    Type: Autodesk.Revit.DB.Lighting..::..ColorPreset The enum value which determines the preset value
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PresetInitialColor Class
PresetInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace